Changweibin/TEST/Drivers/FM33LD5xx_FL_Driver/Inc/fm33ld5xx_fl_pmu.h
/**
  *******************************************************************************************************
  * @file    fm33ld5xx_fl_pmu.h
  * @author  FMSH Application Team
  * @brief   Head file of PMU FL Module
  *******************************************************************************************************
  * @attention
  * Copyright 2025 SHANGHAI FUDAN MICROELECTRONICS GROUP CO., LTD.(FUDAN MICRO.)
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met: 
  *
  * 1. Redistributions of source code must retain the above copyright notice,
  *    this list of conditions and the following disclaimer.
  *
  * 2. Redistributions in binary form must reproduce the above copyright notice,
  *    this list of conditions and the following disclaimer in the documentation
  *    and/or other materials provided with the distribution.
  *
  * 3. Neither the name of the copyright holder nor the names of its contributors
  *    may be used to endorse or promote products derived from this software without
  *    specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS"AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
  * ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE
  * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
  * AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
  * (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
  * SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  *******************************************************************************************************
  */


/* Define to prevent recursive inclusion---------------------------------------------------------------*/
#ifndef __FM33LD5XX_FL_PMU_H
#define __FM33LD5XX_FL_PMU_H

#ifdef __cplusplus
extern "C" {
#endif
/* Includes -------------------------------------------------------------------------------------------*/
#include "fm33ld5xx_fl_def.h"
/** @addtogroup FM33LD5XX_FL_Driver
  * @{
  */
/* Exported types -------------------------------------------------------------------------------------*/
/** @defgroup PMU_FL_ES_INIT PMU Exported Init structures
  * @{
  */

/**
  * @brief FL PMU Init Sturcture definition
  */
typedef struct
{
    /* 低功耗模式配置 */
    uint32_t powerMode;

    /* 睡眠模式配置 */
    uint32_t deepSleep;

    /* flash唤醒速度控制 */
    uint32_t flashWakeupMode;
           
    /* 额外唤醒延迟 T1A*/
    uint32_t wakeupDelayT1a;
  
    /* CANFD RAM电源模式配置 */
    uint32_t CANFDRAMMode;
  
    /*I-CACHE RAM电源模式配置 */
    uint32_t ICRAMMode;
  
    /* 系统RAM电源模式配置 */
    uint32_t SYSTEMRAMMode;

} FL_PMU_SleepInitTypeDef;
/**
  * @}
  */
/* Exported constants ---------------------------------------------------------------------------------*/
/** @defgroup PMU_FL_Exported_Constants PMU Exported Constants
  * @{
  */

#define    PMU_CR_AVREF_SH_Pos                                    (24U)
#define    PMU_CR_AVREF_SH_Msk                                    (0x3U << PMU_CR_AVREF_SH_Pos)
#define    PMU_CR_AVREF_SH                                        PMU_CR_AVREF_SH_Msk

#define    PMU_CR_WKFSEL_Pos                                      (10U)
#define    PMU_CR_WKFSEL_Msk                                      (0x3U << PMU_CR_WKFSEL_Pos)
#define    PMU_CR_WKFSEL                                          PMU_CR_WKFSEL_Msk

#define    PMU_CR_SLPDP_Pos                                       (9U)
#define    PMU_CR_SLPDP_Msk                                       (0x1U << PMU_CR_SLPDP_Pos)
#define    PMU_CR_SLPDP                                           PMU_CR_SLPDP_Msk

#define    PMU_CR_PMOD_Pos                                        (0U)
#define    PMU_CR_PMOD_Msk                                        (0x3U << PMU_CR_PMOD_Pos)
#define    PMU_CR_PMOD                                            PMU_CR_PMOD_Msk

#define    PMU_WKTR_FWUP_Pos                                      (3U)
#define    PMU_WKTR_FWUP_Msk                                      (0x1U << PMU_WKTR_FWUP_Pos)
#define    PMU_WKTR_FWUP                                          PMU_WKTR_FWUP_Msk

#define    PMU_WKTR_T1A_Pos                                       (0U)
#define    PMU_WKTR_T1A_Msk                                       (0x3U << PMU_WKTR_T1A_Pos)
#define    PMU_WKTR_T1A                                           PMU_WKTR_T1A_Msk

#define    PMU_WKFR0_SVDWKF_Pos                                   (30U)
#define    PMU_WKFR0_SVDWKF_Msk                                   (0x1U << PMU_WKFR0_SVDWKF_Pos)
#define    PMU_WKFR0_SVDWKF                                       PMU_WKFR0_SVDWKF_Msk

#define    PMU_WKFR0_UART3WKF_Pos                                 (29U)
#define    PMU_WKFR0_UART3WKF_Msk                                 (0x1U << PMU_WKFR0_UART3WKF_Pos)
#define    PMU_WKFR0_UART3WKF                                     PMU_WKFR0_UART3WKF_Msk

#define    PMU_WKFR0_UART2WKF_Pos                                 (28U)
#define    PMU_WKFR0_UART2WKF_Msk                                 (0x1U << PMU_WKFR0_UART2WKF_Pos)
#define    PMU_WKFR0_UART2WKF                                     PMU_WKFR0_UART2WKF_Msk

#define    PMU_WKFR0_UART1WKF_Pos                                 (27U)
#define    PMU_WKFR0_UART1WKF_Msk                                 (0x1U << PMU_WKFR0_UART1WKF_Pos)
#define    PMU_WKFR0_UART1WKF                                     PMU_WKFR0_UART1WKF_Msk

#define    PMU_WKFR0_UART0WKF_Pos                                 (26U)
#define    PMU_WKFR0_UART0WKF_Msk                                 (0x1U << PMU_WKFR0_UART0WKF_Pos)
#define    PMU_WKFR0_UART0WKF                                     PMU_WKFR0_UART0WKF_Msk

