Changweibin/TEST/Drivers/FM33LD5xx_FL_Driver/Inc/fm33ld5xx_fl_pmu.h
#define    PMU_WKFR0_COMP4WKF_Pos                                 (24U)
#define    PMU_WKFR0_COMP4WKF_Msk                                 (0x1U << PMU_WKFR0_COMP4WKF_Pos)
#define    PMU_WKFR0_COMP4WKF                                     PMU_WKFR0_COMP4WKF_Msk

#define    PMU_WKFR0_COMP3WKF_Pos                                 (23U)
#define    PMU_WKFR0_COMP3WKF_Msk                                 (0x1U << PMU_WKFR0_COMP3WKF_Pos)
#define    PMU_WKFR0_COMP3WKF                                     PMU_WKFR0_COMP3WKF_Msk

#define    PMU_WKFR0_COMP2WKF_Pos                                 (20U)
#define    PMU_WKFR0_COMP2WKF_Msk                                 (0x1U << PMU_WKFR0_COMP2WKF_Pos)
#define    PMU_WKFR0_COMP2WKF                                     PMU_WKFR0_COMP2WKF_Msk

#define    PMU_WKFR0_COMP1WKF_Pos                                 (17U)
#define    PMU_WKFR0_COMP1WKF_Msk                                 (0x1U << PMU_WKFR0_COMP1WKF_Pos)
#define    PMU_WKFR0_COMP1WKF                                     PMU_WKFR0_COMP1WKF_Msk

#define    PMU_WKFR0_IOWKF_Pos                                    (16U)
#define    PMU_WKFR0_IOWKF_Msk                                    (0x1U << PMU_WKFR0_IOWKF_Pos)
#define    PMU_WKFR0_IOWKF                                        PMU_WKFR0_IOWKF_Msk

#define    PMU_WKFR0_CANFDWKF_Pos                                 (15U)
#define    PMU_WKFR0_CANFDWKF_Msk                                 (0x1U << PMU_WKFR0_CANFDWKF_Pos)
#define    PMU_WKFR0_CANFDWKF                                     PMU_WKFR0_CANFDWKF_Msk

#define    PMU_WKFR0_LPTWKF_Pos                                   (12U)
#define    PMU_WKFR0_LPTWKF_Msk                                   (0x1U << PMU_WKFR0_LPTWKF_Pos)
#define    PMU_WKFR0_LPTWKF                                       PMU_WKFR0_LPTWKF_Msk

#define    PMU_WKFR0_BST16WKF_Pos                                 (10U)
#define    PMU_WKFR0_BST16WKF_Msk                                 (0x1U << PMU_WKFR0_BST16WKF_Pos)
#define    PMU_WKFR0_BST16WKF                                     PMU_WKFR0_BST16WKF_Msk

#define    PMU_WKFR0_DBGWKF_Pos                                   (9U)
#define    PMU_WKFR0_DBGWKF_Msk                                   (0x1U << PMU_WKFR0_DBGWKF_Pos)
#define    PMU_WKFR0_DBGWKF                                       PMU_WKFR0_DBGWKF_Msk

#define    PMU_WKFR1_WKPx_FLAG_Pos                                (0U)
#define    PMU_WKFR1_WKPx_FLAG_Msk                                (0xffU << PMU_WKFR1_WKPx_FLAG_Pos)
#define    PMU_WKFR1_WKPx_FLAG                                    PMU_WKFR1_WKPx_FLAG_Msk

#define    PMU_IER_LPRUN_Pos                                      (0U)
#define    PMU_IER_LPRUN_Msk                                      (0x1U << PMU_IER_LPRUN_Pos)
#define    PMU_IER_LPRUN                                          PMU_IER_LPRUN_Msk

#define    PMU_ISR_LPRUN_Pos                                      (0U)
#define    PMU_ISR_LPRUN_Msk                                      (0x1U << PMU_ISR_LPRUN_Pos)
#define    PMU_ISR_LPRUN                                          PMU_ISR_LPRUN_Msk

#define    PMU_RAMCR_CANFDRAMPG_Pos                               (10U)
#define    PMU_RAMCR_CANFDRAMPG_Msk                               (0x3U << PMU_RAMCR_CANFDRAMPG_Pos)
#define    PMU_RAMCR_CANFDRAMPG                                   PMU_RAMCR_CANFDRAMPG_Msk

#define    PMU_RAMCR_ICRAMPG_Pos                                  (8U)
#define    PMU_RAMCR_ICRAMPG_Msk                                  (0x3U << PMU_RAMCR_ICRAMPG_Pos)
#define    PMU_RAMCR_ICRAMPG                                      PMU_RAMCR_ICRAMPG_Msk

#define    PMU_RAMCR_SYSRAMPG_Pos                                 (8U)
#define    PMU_RAMCR_SYSRAMPG_Msk                                 (0x3U << PMU_RAMCR_SYSRAMPG_Pos)
#define    PMU_RAMCR_SYSRAMPG                                     PMU_RAMCR_SYSRAMPG_Msk

#define    PMU_BUFCR_AVREFBUF_OUTEN_Pos                           (5U)
#define    PMU_BUFCR_AVREFBUF_OUTEN_Msk                           (0x1U << PMU_BUFCR_AVREFBUF_OUTEN_Pos)
#define    PMU_BUFCR_AVREFBUF_OUTEN                               PMU_BUFCR_AVREFBUF_OUTEN_Msk

#define    PMU_BUFCR_AVREFBUF_EN_Pos                              (4U)
#define    PMU_BUFCR_AVREFBUF_EN_Msk                              (0x1U << PMU_BUFCR_AVREFBUF_EN_Pos)
#define    PMU_BUFCR_AVREFBUF_EN                                  PMU_BUFCR_AVREFBUF_EN_Msk

#define    PMU_BUFCR_VPTATBUFFER_OUTEN_Pos                        (3U)
#define    PMU_BUFCR_VPTATBUFFER_OUTEN_Msk                        (0x1U << PMU_BUFCR_VPTATBUFFER_OUTEN_Pos)
#define    PMU_BUFCR_VPTATBUFFER_OUTEN                            PMU_BUFCR_VPTATBUFFER_OUTEN_Msk

#define    PMU_BUFCR_VPTATBUFFER_EN_Pos                           (2U)
#define    PMU_BUFCR_VPTATBUFFER_EN_Msk                           (0x1U << PMU_BUFCR_VPTATBUFFER_EN_Pos)
#define    PMU_BUFCR_VPTATBUFFER_EN                               PMU_BUFCR_VPTATBUFFER_EN_Msk

#define    PMU_PTATCR_EN_Pos                                      (0U)
#define    PMU_PTATCR_EN_Msk                                      (0x1U << PMU_PTATCR_EN_Pos)
#define    PMU_PTATCR_EN                                           PMU_PTATCR_EN_Msk





#define    FL_PMU_WAKEUP0_PIN                                     (0x1U << 0U)
#define    FL_PMU_WAKEUP1_PIN                                     (0x1U << 1U)
#define    FL_PMU_WAKEUP2_PIN                                     (0x1U << 2U)
#define    FL_PMU_WAKEUP3_PIN                                     (0x1U << 3U)
#define    FL_PMU_WAKEUP4_PIN                                     (0x1U << 4U)
#define    FL_PMU_WAKEUP5_PIN                                     (0x1U << 5U)
#define    FL_PMU_WAKEUP6_PIN                                     (0x1U << 6U)
#define    FL_PMU_WAKEUP7_PIN                                     (0x1U << 7U)



#define    FL_PMU_AVERF_SAMPLE_HOLD_2MS                           (0x0U << PMU_CR_AVREF_SH_Pos)
#define    FL_PMU_AVERF_SAMPLE_HOLD_4MS                           (0x1U << PMU_CR_AVREF_SH_Pos)
#define    FL_PMU_AVERF_SAMPLE_HOLD_8MS                           (0x2U << PMU_CR_AVREF_SH_Pos)
#define    FL_PMU_AVERF_SAMPLE_HOLD_16MS                          (0x3U << PMU_CR_AVREF_SH_Pos)


#define    FL_PMU_SLEEP_MODE_DEEP                                 (0x1U << PMU_CR_SLPDP_Pos)
#define    FL_PMU_SLEEP_MODE_NORMAL                               (0x0U << PMU_CR_SLPDP_Pos)


#define    FL_PMU_POWER_MODE_ACTIVE                               (0x0U << PMU_CR_PMOD_Pos)
#define    FL_PMU_POWER_MODE_SLEEP_OR_DEEPSLEEP                   (0x2U << PMU_CR_PMOD_Pos)


#define    FL_PMU_FLASH_WAKEUP_MODE_NORMAL                         (0x0U << PMU_WKTR_FWUP_Pos)
#define    FL_PMU_FLASH_WAKEUP_MODE_FAST                           (0x1U << PMU_WKTR_FWUP_Pos)


